import React from 'react';

const Aarti: React.FC = () => {
  return (
    <div className="container mx-auto py-8 px-4">
      <h2 className="text-3xl font-bold mb-4">Aarti</h2>
      <div className="bg-white shadow-md rounded-lg p-6">
        <h3 className="text-2xl font-semibold mb-4">Shri Lakshmi Narsingh Aarti</h3>
        <p className="mb-4">
         आरती नरसिंह बाबाकी उतारो खम्यफटये की। <br></br>
          प्रेम से भक्त प्रहलाद रटा पिता की शक्ति से नड़टां ।।  <br></br>
          ध्यान में मग्न राम का शब्द भक्त का मान रखैये की ।। आरती. ।। <br></br>

खम्व को लाल अगनी कीना, भक्त लेजा लिपटा दीना ।। <br></br>
          लम्ब से निकली गुन्ज भरी असुरणी गर्भ गिरैये की । <br></br>
          खड़ग को खम्ब पेजा दीनां कहां तेरा राम वता देना ।। <br></br>
          रूप हे उग्र अति के हरि नरसे सिंह बनये की ।। आरती. ।। <br></br>

दैत्वका फाटत है सिना देख तद् रुपमति हीना । <br></br>
          रूप है उग्र अधिक ही अपार शान्त ही ध्यान धरैय की ।। आरती. ।। <br></br>

जिवहा बनी हुई छुरधार मुकुटि ढेडी बहुत विशाल  <br></br>
          फटत जब हृदय असुर सब डरत खम्ब से प्रगट न्दाले की ।। आरती. ।। <br></br>

शिशपर जटा अति प्यारी किर में दाढ़ी सी छारी ।  <br></br>
          नेत्र हैं लाला लाल भारी अंग में पिताम्बर धारी ।। आरती. ।। <br></br>

गले में वेजन्तीमाला शिशपर मुकुट घरा न्यारा । <br></br>
          कान में कुण्डल अतिप्यारा कर में संख चक्र धारी ।। आरती. ।। <br></br>

लक्ष्मी जी वांमे अंग बिलसे देवता दर्शन को तरसे । <br></br>
          गगन से पुष्प बहुत वर्षे महिपर मंगलकारी की ।। आरती.।। <br></br>

गजको ग्राहने आ जकड़ा टरसुन ग्राहको जा पकड़ा <br></br> 
          फिराकर चक्र काट ग्राइक गरुड़ तज धावन वाले की ।। आरती.।। <br></br>

आरती श्री नृसिंह गाये गाते पद वो अमर पावे । <br></br>
          हरि यु कहता करजोरे लाज रख विष्णुदास कुल की ।। आरती. ।। <br></br> 
          सेवक यु कहता करजोरे लाज रख हम सब भक्तों की । <br></br>
        </p>
        <h3 className="text-2xl font-semibold mb-4">आरती ओम जय जगदीश हरे</h3>
        <p className="mb-4">
        ॐ जय जगदीश हरे, स्वामी। जय जगदीश हरे। <br></br>
              भक्त जनों के संकट, क्षण में दूर करे ॥ ॐ जय जगदीश हरे।<br></br>

जो ध्यावे फल पावे, दुःख विनसे मन का। स्वामी दुःख विनसे मन का। <br></br>
सुख सम्पत्ति घर आवे, कष्ट मिटे तन का ॥ ॐ जय जगदीश हरे।<br></br>

मात-पिता तुम मेरे, शरण गहूँ में किसकी। स्वार्मी शरण गहूँ मैं किसकी।<br></br>
 तुम बिन और न दूजा, आस करूँ जिसकी ॥ ॐ जय जगदीश हरे ।<br></br>

तुम पूरण परमात्मा, तुम अन्तर्यामी। स्वामी तुम अन्तर्यामी ।<br></br>
 पारब्रह्म परमेश्वर, तुम सबके स्वामी ॥ ॐ जय जगदीश हरे।<br></br>

तुम करुणा के सागर, तुम पालन कर्ता । स्वामी तुम पालन-कर्ता ।<br></br>
 में मूरख खल कामी, कृपा करो भर्ता ॥ ॐ जय जगदीश हरे।<br></br>

तुम हो एक अगोचर, सबके प्राणपति । स्वामी सबके प्राणपति ।<br></br>
 किस विधि मिलूँ दयामय, तुमको मैं कुमति ॥ ॐ जय जगदीश हरे ।<br></br>

दीनबन्धु दुखहर्ता, तुम ठाकुर मेरे। स्वामी तुम ठाकुर मेरे। <br></br>
अपने हाथ उठाओ, द्वार पड़ा तेरे ॥ ॐ जय जगदीश हरे ।<br></br>

विषय-विकार मिटाओ, पाप हरो देवा । स्वभी पाप हरो देवा ।<br></br>
 श्रद्धा-भक्ति बढ़ाओ, सन्तन की सेवा ॥ ॐ जय जगदीश हरे।<br></br>

श्री लक्ष्मीनरसिंहजी की आरती, जो कोई नर गावे।<br></br>

स्वामी जो कोई नर गावे ।<br></br>

कहत शिवानन्द स्वामी, सुख संपत्ति पावे ॥<br></br>

ॐ जय जगदीश हरे।
        </p>
        
      </div>
    </div>
  );
};

export default Aarti;