import React from 'react';

const About: React.FC = () => {
  return (
    <div className="container mx-auto py-8 px-4">
      <h2 className="text-3xl font-bold mb-4">About Our Mandir</h2>
      <p className="mb-4">
      भक्त शिरोमणि गौपालक त्यागमूर्ति श्री श्री १००८ श्री स्वामी विष्णुदास जी महाराज, हसामपुर पीठ के संस्थापक, का जन्म संवत १४४४(1444) में हुआ।      </p>
      <p className="mb-4">
      प्राकट्य प्रसंग में से सुनी हुई कथानुसार सिंह ने गऊ पर आक्रमण किया। भयभीत गऊ की रक्षार्थ स्वामी जी ने स्वंय को सिंह के सम्मुख प्रस्तुत किया।      </p>
      <p>
      आपकी अनन्य भक्ति असीम त्याग एवं निश्छल प्रेम समर्पण और सेवा से द्रवीभूत होकर नृसिंह भगवान ने सिंह गर्जना करते हुए दर्शन दिये और स्वंय को भारी भरकम शिला के नीचे से निकालने का आदेश किया। जो स्वामी जी के स्पर्श मात्र से सरक गई और श्री नृसिंह भगवान की शालिग्राम मूर्ति रूप का झालर शंख, घंटा, घडियाल की ध्वनि के साथ प्राकट्य हुआ।      </p>
      <p className="mb-4">
      इस अलौकिक मूर्ति की सेवा स्वरुप स्वामी जी के पुत्र श्री श्री १००८ श्री गंगादास जी महाराज का जन्म संवत् १४७६ में हुआ। जिन्होंने अपने पिता की भांति ही असीम भक्ति त्याग, तपस्या एवं सम्पूर्ण समर्पित प्रभु प्रेम के चल पर मंदिर की कीर्ति को दसों दिशाओं में विजयमान किया।      </p>
    </div>
  );
};

export default About;