import React from 'react';

const BhogAarti: React.FC = () => {
  return (
    <div className="container mx-auto py-8 px-4">
      <h2 className="text-3xl font-bold mb-4">Bhog Aarti</h2>
      <div className="bg-white shadow-md rounded-lg p-6">
        <h3 className="text-2xl font-semibold mb-4">श्री नृसिंह भगवान भोग आरती</h3>
        <p className="mb-4">
          महाप्रभु आरोगो नृसिंह दयानिधि आरोगो नृसिंह <br></br>
          छप्पन भोग छत्तीसों व्यंजन, नाना विधि के कंद ।1। <br></br>
          महाप्रभु आरोगो नृसिंह दयानिधि आरोगो नृसिंह<br></br>
          दुर्योधन घर मेवा त्यागी, तो शाक विदुर घर पायो ।2।<br></br>

महाप्रभु आरोगो नृसिंह दयानिधि आरोगो नृसिंह <br></br>
          भीलनी के बेर सुदामा के तंदुल, रुचि रुचि भोग लगाओ 131<br></br> 
          महाप्रभु आरोगो नृसिंह दयानिधि आरोगो नृसिंह<br></br>
          करमा बाई को खीचड़ो खायो, तो भक्ता को मान बढ़ायो 141<br></br> 
          महाप्रभु आरोगो नृसिंह दयानिधि आरोगो नृसिंह <br></br>
          नारद मुनि पनवाड़ो ल्याये, तो जल भर ल्याये श्री गंग ।5।<br></br>
          महाप्रभु आरोगो नृसिंह दयानिधि आरोगो नृसिंह <br></br>
          लक्ष्मी जी भोजन आप बनावे, तो मन में बहुत उमंग ।<br></br>
          महाप्रभु आरोगो नृसिंह दयानिधि आरोगो नृसिंह 161<br></br>
          चारों भैया जीमन बैठे, तो मात् कोशल्या उमंग।<br></br>
          महाप्रभु आरोगो नृसिंह दयानिधि आरोगो नृसिंह 161<br></br>
          प्रेम भाव से भोजन करियो, तो करियो बहुत आनंद।<br></br>
          महाप्रभु आरोगो नृसिंह दयानिधि आरोगो नृसिंह 171<br></br>
          सनक सनंदन चंवर डुलावत, तो गावत वेद अनन्त । <br></br>
          महाप्रभु आरोगो नृसिंह दयानिधि आरोगो नृसिंह 18। <br></br>
          दास वैजन्ती गाली जो गावें, तो मन में बहुत उमंग ।<br></br>
          महाप्रभु आरोगो नृसिंह दयानिधि आरोगो नृसिंह 191<br></br>
          आओ जी कन्हैया आपा चौपड़ खेला, आओ जी सांवरिया आपा चौपड़ खेला तो बाजी लगाई गुरु ज्ञान की ले, तो जाइजे रै कांनुडा बीडो पान की ।10। <br></br>पान की रे पान की और रस ज्ञान की, और गुरु ज्ञान की, और माता जानकी, ले तो जाइजे रै कांनुडा बीडो पान की ।11।
        </p>
        
      </div>
    </div>
  );
};

export default BhogAarti;